; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	infrared1 - mode
	Star7 - direction
	GroundStation3 - direction
	Star9 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation8 - direction
	Star1 - direction
	GroundStation6 - direction
	Star4 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star9)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation8)
	(supports instrument7 infrared1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star9)
	(supports instrument8 infrared1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation8)
	(supports instrument10 infrared1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star1)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 GroundStation2)
	(pointing satellite2 Phenomenon14)
	(have_image Star10 infrared1)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared0)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 infrared1)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation3 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 planet15 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet15)
   goals met: 0 of 10
5. (take_image satellite2 planet15 instrument5 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 1 of 10
6. (turn_to satellite2 planet13 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet13)
   goals met: 1 of 10
7. (take_image satellite2 planet13 instrument5 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 10
9. (turn_to satellite0 star4 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star4)
   goals met: 3 of 10
10. (take_image satellite2 phenomenon12 instrument5 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 4 of 10
11. (turn_to satellite1 groundstation2 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation2)
   goals met: 5 of 10
12. (turn_to satellite2 planet16 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet16)
   goals met: 5 of 10
13. (take_image satellite2 planet16 instrument5 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 6 of 10
14. (turn_to satellite2 star10 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star10)
   goals met: 6 of 10
15. (take_image satellite2 star10 instrument5 infrared1)
   added: (have_image star10 infrared1)
   goals met: 7 of 10
16. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 7 of 10
17. (take_image satellite2 star11 instrument5 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 10
18. (turn_to satellite2 phenomenon14 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 phenomenon14)
   goals met: 9 of 10
19. (take_image satellite2 phenomenon14 instrument5 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 10 of 10
